app/views/posts/_post.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 8]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 6]]
SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = $1  [["post_id", 6]]
---
  <p><%= @post.text %> </p>
  <p>Comments : <%= @post.comments.size%>  Likes : <%= @post.likes.size %> </p>

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 6]]
---
<ul class="comments">
  <% @post.comments.each do |comment| %>