app/views/posts/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 8]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 7]]
SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = $1  [["post_id", 7]]
---
        <small class="user-counters">
          <p>Comments : <%= @post.comments.size%></p>
          <p>Likes : <%= @post.likes.size %></p>